{
  "query": "Intellectual Property Litigation",
  "date": "2025-07-27T19:42:24.053808",
  "articles": [
    {
      "source": "The Verge",
      "author": "Mia Sato",
      "title": "Knock it off!",
      "description": "Cassey Ho was getting her roots dyed when she started receiving hundreds of ecstatic messages. In a video clip promoting her song “Fortnight,” Taylor Swift was shown wearing the Pirouette Skort, a flouncy, tutu-style skirt with built-in shorts underneath, tha…",
      "url": "https://www.theverge.com/cs/features/709635/knock-it-off",
      "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/07/VERGE_FINAL1-1.gif?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
      "publishedAt": "2025-07-22T12:04:03Z",
      "content": "CasseyCassey Ho was getting her roots dyed when she started receiving hundreds of ecstatic messages. In a video clip promoting her song “Fortnight,” Taylor Swift was shown wearing the Pirouette Skort, a flouncy, tutu-style skirt with built-in shorts underneath, that Ho had designed for her athleisure brand Popflex. She knew immediately this exposure — one of the world’s biggest pop stars, flaunting Ho’s design — would be life-changing.\n\n“I am just numb. I can’t even scream, I can’t even speak,” she recalls of the moment she realized what was happening. “I am just dead.” Even though it appeared for literally one second in Swift’s video, that brief moment caused the entire inventory of thousands of skorts to be snapped up within an hour, and a week later, over 10,000 customers had placed preorders for the product (to date, Popflex has sold over 50,000 Pirouette Skorts in total).\n\nThen came the dupes.\n\nThe Popflex skort caught the attention of a more ominous group: imitators, or more precisely, companies churning out look-alikes of popular clothing items. Within weeks, Pirouette Skort copies — mesh ruffles, drawstring waistband, pastel colors and all — had flooded the web. More than a year later, they haven’t stopped. And there is not much Ho, who built a fitness empire around her popular YouTube channel, can do about it, even as someone with a large and recognizable platform.\n\nCopycat Pirouette Skorts have been sold on Amazon, eBay, AliExpress, TikTok Shop, DHGate, Temu, Shein, and countless other fly-by-night storefronts that will seemingly disappear as quickly as they popped up. They are cheaper, faster, and shameless; many of the listings do not even show the actual item that is being sold. They simply use Popflex’s copyrighted images without permission, sometimes editing the color of the skort in the photo to fit the listing. In May 2025 alone, Popflex counted 461 listings it believes infringe on its Pirouette Skort design patent, but it’s still a drop in the bucket of the thousands that Ho has encountered just by doing reverse image searches.\n\n“I don’t have the time or the money to go after all of these infringements, all these dupers,” Ho says. “It’s just too much.” Many listings live on, copyrighted images promoting a product of unknown origin and quality.\n\nDupes for popular, covetable products are nothing new: for hundreds of years, people have meticulously copied other artists’ work, from forged ancient Chinese art, to licensed replicas of designer ballgowns in the 1940s, to knockoff phone chargers meant to mimic Apple aesthetics. The internet has helped dupes spread like wildfire, so much so that even relatively niche and unknown products — in fashion, home goods, makeup, and tech — likely have a doppelgänger floating around out there. It has never been faster or easier to make and sell a copy of something. What was once relegated to Canal Street is now an industry in and of itself. Some companies seem to operate with the express purpose of copying popular (or even niche) consumer products. And for American shoppers already accustomed to inexpensive products, finding the same thing for less is second nature.\n\nLiving among copies of something else is as ordinary an experience as scrolling past three of the same posts, one after another, on any given social media site. The similitude of consumers’ options has even upended certain corners of the legal system, where intellectual property rights holders are trying to fight the speed and scale of the internet with their own — at times flawed — versions of the same. It is dupes all the way down.\n\nHereHere are just a few of the things that have been duped, according to people online: makeup, Le Creuset Dutch ovens, hand sanitizer, designer perfumes, Apple AirPods Max, Oura Ring fitness trackers, viral phone cases, dishwasher pods, famous banana pudding recipes, Pilates workouts, and the entire island of Santorini.\n\nAcross platforms like TikTok, Instagram, and online forums, content creators have built entire personas and brands on the promise of finding lower-cost versions of popular products. This phenomenon isn’t exactly new — for years celebrity and fashion blogs have done something similar — but the dupe industrial complex has taken on a new life in the age of influencer marketing. Grocery chain Trader Joe’s, for example, regularly releases cosmetics that are unsubtle in their imitation of existing, popular products: lip glosses, body washes, lotions, and more with near-identical packaging, concepts, and even formulas to other brands’ products. While the average shopper might not catch the reference, those in the know seek the products out. Content begets more content, a cycle of someone making a video about a dupe, someone else watching it, buying the same dupe, and recording their own review.\n\nDupe enthusiasts lean on the same rhetoric that the internet is built on: that wider accessibility is a democratizing force. But unlike democratizing the media industry through citizen journalism, or learning video editing via YouTube tutorials, a dupe begins by picking up an existing work or idea. A dupe is valuable precisely because of the value of the original, and without it, the dupe is just another tube of lip gloss. For some consumers, dupes are proof that the original is overpriced and taking advantage of the consumer. If a company can make a dupe that’s $10 less, the originator must be ripping us off, the thinking goes; the creative work of making something new in the first place is worthless, reduced to a game of who can do it cheaper.\n\nSome social media platforms have taken to displaying scary-sounding notices when a user searches for the word “dupes” — a query on Instagram for “Apple dupes” returns a blank results page that urges users to “protect [their] favorite brands” against “counterfeit goods.” A search on TikTok for “Amazon dupes” returns a message reading, in part, “Fight Piracy, Champion Creativity … the promotion of counterfeit goods are not allowed on our platform and violate our policies and Community Guidelines.” Interestingly, a search on Amazon for “Skims dupes” — Skims being the minimalist clothing line by Kim Kardashian — doesn’t return any kind of scold-y message, just pages of similar products. Dupes are not synonymous with counterfeits — intentional imitations that the law often recognizes as trademark infringement — but exist in something of a gray zone, often not quite illegal but a little gross-feeling all the same.\n\nMarketing a product as a dupe has a powerful effect: descriptions like “alternative” or “imitation” just don’t have the same pull. A dupe shouldn’t just be less expensive than the apparent original — it also must be an adequate substitute, whether that means they look the same, feel the same, or do (roughly) the same thing. The buyer doesn’t want to simply get a good deal; they want to feel like they stumbled into a secret, like they pulled a fast one on the companies charging more than what’s right.\n\n“[The thinking is] a little bit of an ‘I deserve it,’” Alexandra J. Roberts, a professor at Northeastern University School of Law who has written about the dupes market, says. “‘It’s not my fault the economy is the way it is, and if I want nice things, I should be able to get them and get them cheap.’”\n\nSome industries, like beauty, have a long tradition of churning out similar (sometimes cheaper) products, and for good reason: favorite lipstick shades get discontinued, formulas get reworked, and some products don’t work for all skin types. In post-WWII Japan, craftsmen and fashion lovers meticulously re-created American garments brought over by soldiers that were out of reach for young shoppers. Some have argued that Japanese brands iterated on — and then perfected — Americana style.\n\nNow dupes have spread to just about every industry imaginable, and they aren’t just comparisons created by shoppers; Roberts notes that brands and retailers have called their products “dupes” as a promotional tactic. (Here’s Whole Foods’ TikTok account calling its house-brand foods “dupes,” for example.) But there’s a word-of-mouth quality pervasive in dupe content — “I saw someone else post about this viral dupe” is a common opening hook to videos that have racked up millions of views online. Dupe content is so popular that simply posting about potential alternatives can be a whole career for influencers. Take the curious case of two Amazon influencers engaged in a bitter legal fight over allegations of unlawful copying: both women regularly promote products that are look-alikes for higher-end items. They earn a commission each time a viewer purchases an item through their affiliate links, whether that’s a handbag “inspired” by a luxury version or sofas designed to mimic a style popular among the ultra-wealthy. They profit off the veneer of a lifestyle — and a house full — of opulence, while accusing the other of biting their vibe. It’s not just that the products they push are often diluted versions of an original; even the influencers themselves are basically dupes, an endless game of telephone that carries, copies, and eventually distorts and replaces the original reference or design.\n\nIt’s not entirely surprising that our physical goods have come to mirror the digital content that sandwiches our purchases. The websites that compete to bring us information (and scoop up our traffic) have grown to look nearly indistinguishable from one another. Social media recommendation algorithms depend on scale and similarity, not originality: they feed users more of the same based on finely tuned preferences. That repetition has escaped the containment of digital worlds. The web has become a drumbeat of derivative works and characters repackaged in mind-numbing — and sometimes creepy — ways. Now it has infiltrated our living rooms, closets, and pantries, the very contours of our lives.\n\nWhenWhen Ho’s skort was first ripped off by Shein, the popular ultra-cheap Chinese retailer, she joined the ranks of knitwear designers, artists, stained-glass artisans, and others who’ve seen their work wind up on fast-fashion sites. “You need to copyright this!” is a common response to businesses that find their products have been copied by bigger companies, but those who do pursue this route might find that the law is more complicated than they imagined.\n\nUnlike traditional counterfeits and copyright violations — a handbag covered in the Louis Vuitton logo but sold for just a few dollars, for example, or a copyrighted photograph printed on a T-shirt — dupes are not as straightforward, at least legally. The Pirouette Skort dupes don’t claim to be Popflex products, and they don’t include the Popflex name, logo, or branding, making a trademark claim moot. There’s no obviously copyrightable artwork on something like Ho’s skort.\n\nWhen it comes to fashion, the bulk of designers’ work is not protectable, says Roberts. Elements like logos or artwork on designs, and trade-dress protections that cover distinctive product design — like specific stitching on Vans shoes, for example — are “mostly exceptions to the rule,” Roberts says. If a random online storefront is using a brand’s copyrighted image to promote its look-alike products, that’s a straightforward DMCA takedown.\n\nFor dupes, it’s not as simple. The nuance between what’s allowed and what isn’t means that the public debate is often emotionally charged and convoluted — sometimes simply vibes-based. “Is this dupe OK?” isn’t just a question of IP law, but is viewed through a series of overlapping political, social, and ethical arguments. It can quickly spiral into conversations about whether poor people deserve nice things; whether a design is unique enough to warrant protection; and whether the business owner is deserving of sympathy or ridicule. It’s a legal question filtered through a moral lens, and the jury is made up of any social media user who happens across a video or post about a dupe.\n\nIt doesn’t help that the language we use to describe two things that look alike is itself extremely muddy: “dupe,” “knockoff,” “counterfeit,” and “copy” are often used interchangeably even when they have distinct meanings. Discussion of dupes also tends to be framed in black-and-white terms; they’re either perfectly above board, even righteous (a lower price point means expanded accessibility), or they’re unethical and dangerous.\n\n“Between those two poles, there is some gray area,” Roberts says. Some companies purposely toe the line of infringement while still technically being in the clear. Some design elements — rugby shirts in classic colors — are so standard and widely sold that no one entity can realistically “own” them. And often, only a portion of a design is protected: courts have found that the iconic red soles of Christian Louboutin shoes are only a protected trademark when they’re applied to shoes of a contrasting color, for example. An all-red shoe with a red sole to match? Well, that doesn’t infringe.\n\nOne way Ho has tried to protect her designs is through design patents. Seven of her designs, including the Pirouette Skort and the Corset Pirouette Dress, have received design patents, which protect how things look, as opposed to utility patents, which protect how things work. Design patents are historically popular in the fashion industry, but their use has expanded dramatically into tech in the wake of Apple v. Samsung. The web pages for Ho’s design-patented products boast a design-patent disclaimer, a digital version of a “keep out” sign. On the page for the skort: “The Pirouette Skort is a Patented Design (patent no. US D1,010,983 S) created by Cassey Ho. All artwork and materials associated with the Pirouette Skort design are protected under the law.”\n\nIt took Ho about a year to secure a patent for the widely duped skort, in a process that involved doing lots of research to demonstrate to the US Patent and Trademark Office that her product is, in fact, unique. She also paid extra to have her application fast-tracked using a “Rocket Docket”; without shelling out to have it expedited, she would be waiting for nearly two years. In order to secure a design patent for the skort, Ho paid the USPTO $1,344 (about half of that, $640, was for the Rocket Docket to expedite the application; the rest covered the filing, design search, examination, and issue fees). Once you factor in attorney fees, each patent ends up costing thousands of dollars, Ho says.\n\n“It’s a very expensive cost for me, but it’s extremely powerful, because once I get [the patent], it’s much easier to take the infringing product off of Amazon and certain platforms,” Ho says. “Without it, it was almost like they wouldn’t even listen to you.”\n\nThe Pirouette Skort copycats are enticing. The online pictures look just like the original, because many of the images are the original, pulled straight from Ho’s website and lightly edited. (Many shoppers likely don’t realize they are looking at stolen images.) Listings often have detailed size charts, fabric composition information, and plenty of reviews exalting the quality for the price. I picked two listings on AliExpress from two different storefronts and hit checkout: one skirt from Gym Fitness Expert Store ($16.99) and another from Topmoon Store ($9.52). I also bought the original ($60) to compare.\n\nWhen it comes to dupes, what is promising online often ends up disappointing in the harsh light of day. The spandex waistband on the Popflex original is soft and pliable, what you’d want in a piece of activewear. The skirt is full and flouncy, likely because it uses more mesh fabric yardage than the AliExpress versions to create the gathered tiers. The stitching is neat — no loose threads — and the shorts underneath are a better fit thanks to a more detailed design. Strangely, the two AliExpress skirts are identical down to the unbranded inner care tag despite being from different storefronts — possibly made in the same factory or by the same manufacturer and listed on different storefronts for different prices. The AliExpress dupes, even with their differences, would perhaps be passable if you just wanted the general look of the original Pirouette Skort, but holding them in my hands, it’s clear which one is “real.” The impostors are stiff, oddly proportioned, and inappropriately short. I could not go to the grocery store in them, much less play tennis. They would probably look fine in a photo on social media, though.\n\nHo’s securing of design patents is a good strategy in some ways, Roberts says. But it’s slow compared to the breakneck pace of ultrafast fashion.\n\n“[Shein and Temu] come out with so much stuff so quickly, like within days or hours of … something [going] viral because Taylor Swift wore it. They just churn it out instantly,” Roberts says. “By the time you get the gears moving and the mechanism in place to try to stop them, they’ve moved on to the next thing.”\n\nIndeed, the AliExpress listings I purchased the dupes from have since disappeared — but plenty more have taken their place. People looking for a less-expensive version of the real thing don’t have to look too far: a simple search on Shein for “Popflex” delivers several listings with edited versions of Popflex’s product shots. In one of the more disturbing instances, a video that Ho posted on social media of her modeling the skort was used in an Amazon listing — except her face had been replaced with another woman’s, perhaps using AI, resulting in a deepfake ad for a copycat product.\n\n“Amazon strictly prohibits counterfeit and IP infringing products in our store. We have proactive measures in place to prevent counterfeit or infringing products from being listed, and our advanced technology continually scans our catalog for potential counterfeit, fraud, and abuse,” Amazon spokesperson Juliana Karber told The Verge in an email. Brands can enroll in an Amazon program that helps detect and report potential infringements; Karber says Amazon has “taken action” based on Popflex’s use of the tool.\n\n“There is a distinction between IP infringing products and alternatives to brand-name products. Amazon’s wide selection includes alternatives to brand-name products, which exist across categories and retailers, but do not violate a particular brand’s IP,” Karber says.\n\nAmazon itself acknowledges that a “dupe” — in its current expansive and messy definition — isn’t black and white. It’s easy to find look-alikes and claim infringement; it’s harder to actually litigate it.\n\nInIn November 2023, a Chinese home goods company called AccEncyc (pronounced “accents”) got a vague email from Amazon out of the blue with troubling news: there was an issue with the closet hanging hooks it was selling, and the listing was removed. Not just that, but the funds in its seller account had also been frozen, and it was unable to withdraw its earnings. The details were scarce. It wasn’t like AccEncyc was getting rich on the hooks — in a legal filing, the company said it had sold less than $500 worth of the item — but now it was caught up in federal design patent infringement litigation, with a temporary restraining order upending its business.\n\nEven though the Amazon listing for the hooks in question was removed, AccEncyc’s other products were still for sale on the platform, meaning earnings kept growing even though the company couldn’t withdraw the money from its account, says Timothy A. Duffy, an attorney based in the Chicago area who represents AccEncyc. The money held in AccEncyc’s Amazon account eventually swelled to nearly $50,000 and stayed tied up for months. Overnight, AccEncyc’s Amazon business was thrown into disarray, in a case that is still ongoing. And though the company didn’t know it yet, it was one of dozens of online storefronts getting swept up in a new legal strategy going after alleged dupers.\n\nThe entity suing AccEncyc was Jacki Easlick LLC, a company founded by a fashion and accessories designer who used to work in product development for fashion brands like Vera Bradley and Kenneth Cole, according to Easlick’s LinkedIn. Easlick claimed that AccEncyc and the other sellers named in the suit were ripping off the Tote Hanger, a two-sided hook with a corkscrew middle portion that holds handbags from a closet rod, for which Easlick obtained a design patent in 2013. But the suit wasn’t the typical patent infringement case: in one fell swoop, Easlick’s company was able to take legal action against 67 alleged infringers simultaneously and not just get products taken down, but bring many of their businesses to a grinding halt. All of this happened before AccEncyc could even hire a lawyer.\n\nLawsuits like Easlick’s have become something of a trend with rights owners trying to protect their intellectual property, or, depending on the case, hoping to knock out competing storefronts that they assert infringe on their IP. The cases are referred to as “Schedule A” cases, named after the separate form filed to the court that lists the defendants being sued. It’s standard that the complaint and/or the Schedule A form is filed under seal, meaning there isn’t the same public transparency into the case as other federal suits might have. Even the people and entities named as defendants often do not know they are being sued; some are served notice via emails that sometimes even look scammy, like emails being signed off by “Attorneys of Luke Combs.” Easlick’s suit naming 67 defendants is relatively small potatoes — similar suits have named hundreds of defendants on their Schedule A forms. For rights holders, it’s a cheap and fast way to cast a wide net.\n\n“It has swamped normal design-patent litigation,” Sarah Fackrell, a professor at Chicago-Kent College of Law at the Illinois Institute of Technology and a design-patent expert, says of Schedule A cases. Fackrell, who detailed the phenomenon in a piece for Harvard Law Review, says that while it appears that more of these suits deal with trademark infringement, new design-patent lawsuits are often Schedule A cases.\n\n“If people want to take part in this [but] they don’t have any IP so far, you could go get a design patent pretty quickly,” Fackrell says. “Then all of a sudden [they can] start shaking down people on Amazon. Because that’s what this is — it’s a shakedown scheme.”\n\nEaslick’s suit, filed in the Western District of Pennsylvania, accuses the defendants of duping consumers into thinking the hooks were authentic products from Easlick’s company even when they weren’t; that the alleged copycats were “poorly manufactured products” that risked “injury and disappointment from the confused customers”; and that Easlick’s company was “suffering irreparable and indivisible injury” and “substantial damages” thanks to the alleged impostor handbag hooks that were for sale on sites like Amazon, eBay, and Walmart.\n\nDuffy is based in the epicenter of Schedule A cases: the Northern District of Illinois, where, by one count, 88 percent of these lawsuits were filed. Thousands of these cases have been filed in the Northern District of Illinois; Duffy says he’s worked on at least 50 Schedule A cases in just the last year and a half, and that there are “easily” several hundred of them coming through the court each year. Fackrell has theories about why so many Schedule A cases go through the Northern District of Illinois, but declined to elaborate on the record; one simple answer she offered is that law firms appear to be continuously filing cases there because some judges let them do it. Why judges allow it is a separate (and unresolved) matter.\n\n“[Having] hundreds of defendants, hundreds of thousands of dollars — usually a federal case like that would take a couple of years to sort out,” Duffy says. But using the Schedule A tactic puts plaintiffs at an advantage. “These things get processed like Oreo cookies in a factory.”\n\nThe Schedule A litigation tactic — at least as it is functioning now — is so stacked against defendants that even weaker claims of alleged infringement can get through. Most of the defendants named are based in China, Duffy says, and are unable to pull together a legal team in time for hearings.\n\n“All of a sudden they get an email in a language they can’t really read that says, ‘Your Amazon account is frozen. Call these lawyers,’” Duffy says of clients he represents. “You’ve got to call a lawyer in Chicago and somehow respond to a federal court case if you want your biweekly Amazon payment to come out.” That AccEncyc hired an attorney to defend itself is rare; Duffy says it’s typical that at hearings before a judge, none of the dozens or hundreds of defendants are represented at all.\n\nAttorneys for Easlick initially said they would work to set up an interview, but eventually stopped responding to The Verge’s request for comment.\n\nCritics of the Schedule A tactic also point to the extraordinary forms of relief plaintiffs have been able to secure — sometimes before the accused even understands they’re being sued at all, raising concerns that the defendants named in these suits are not getting due process. Along with asset freezes, rights owners have won default judgments far surpassing any money the alleged infringers made from selling their products. In a 2024 Schedule A trademark case, an Australian woman was one of hundreds of people and businesses sued for allegedly infringing the Grumpy Cat trademark — the viral internet feline whose litigious owners have milked the IP for years. The Guardian reported in April that the woman was ordered to pay $100,000 for a single T-shirt she sold with a cartoon cat printed on it, and also had $600 removed from her PayPal account without warning. Her earnings on the shirt totaled $1.87. The actual Grumpy Cat (real name: Tardar Sauce) died in 2019 at age 7.\n\n“The Schedule A model allows a plaintiff to extract more money from defendants than they would be able to in a full and fair adjudication,” Fackrell writes in her Harvard Law Review piece. “And it allows them to do so at a much lower cost.”\n\nIn the Easlick case, only after some of the defendants hired lawyers did the judge take a closer look at the infringement claims. In reality, Easlick’s bag hooks and the other hooks are not that similar: many of the alleged infringements are different colors and obviously different shapes. “As can be plainly seen, the hooks sold by AccEncyc lack the ‘corkscrew’ twist in the middle of the hook and the ball-shaped ends on plaintiff’s design,” Duffy wrote in a response filed to the court. The judge agreed, finding that AccEncyc’s hook was not substantially the same as Easlick’s patented design. AccEncyc’s money in Amazon that was quickly frozen without question took two and a half months to be released. Easlick is appealing the decision to the Federal Circuit; an amicus brief was filed in the case on behalf of Fackrell and other experts.\n\nSome of the Schedule A cases Duffy has seen have gone “overboard,” going after small businesses — especially those based in China — that are being unfairly generalized as counterfeiters looking to deceive shoppers, he says. Duffy believes AccEncyc’s case could set an important precedent.\n\n“It just goes to show you the danger of having cases like these that are not thoroughly litigated. Usually one side doesn’t even show up,” he says. AccEncyc does not care if it sells handbag hooks or not. But the fate of its case could determine whether others can in the future.\n\nThere are signs that judges are beginning to look more critically at Schedule A cases. In a stunning move in June, a judge in the Northern District of Illinois effectively froze all Schedule A cases in front of him, pending further review of how the court was dealing with them. The judge specifically listed practices like the sealing of cases, the temporary restraining orders, the bundling of multiple defendants, and the fact that cases proceed without one side involved — in other words, all the things that make Schedule A cases especially attractive to plaintiffs.\n\n“Perhaps [the judge] will decide that … these things should keep going, and he’s going to keep granting these things and keep proceeding as usual,” Fackrell says. “But the fact that he’s concerned enough to pause everything is really, really, really extraordinary.”\n\nDuffy and Fackrell both acknowledge that the explosion of Schedule A litigation exists in a world that is awash in copycat items or products that are very similar, if not identical. There are indeed companies — both foreign and domestic — that infringe on IP rights, and brands have valid concerns. Online shopping has become a dumping ground for cookie-cutter junk, galvanized by the limitless shelf space of web-based storefronts. The Northern District of Illinois has similarly been inundated with what some might call garbage legal filings. If you are selling something online and competing with an endless barrage of similar products, it pays to be fast and cheap and to cast as wide a net as possible — whether you are selling handbag hooks and suction cups on Amazon or you are looking for a legal intervention to the China-based sellers who are suddenly your competition. The breakneck pace of e-commerce means that just about anything goes, whether you’re the plaintiff or the one being sued. In this way the two sides are not so different.\n\nOfOf all the viral dupes that have been shoved onto my digital feeds, nothing caused commotion quite like the “Wirkin,” or the Walmart Birkin. For around $80, shoppers could purchase an Hermès Birkin look-alike from Walmart.com, and before long, explainers, reviews, comparisons, and think pieces abounded. The Birkin is not just a flex to prove you are fashionable; it is so hard to get that it’s a status symbol even among rich people. (Hermès is currently being sued by shoppers that allege the company only sells Birkins to people who have racked up a “sufficient purchase history.”) Now a serviceable look-alike was for sale at Walmart, the very antithesis of exclusivity and affluence. To some, the Wirkin was revenge on the 1 percent, a liberatory moment for the rest of us who are now free to carry the clunky handbags ourselves (albeit made of plastic, not leather).\n\n“Walmart making the Birkin bag irrelevant and obsolete is literally one of the best things that happened in 2024,” one TikTok begins. “Luxury is coming to an end,” someone else commented.\n\nThe language of dupes as empowerment — even as a class equalizer — is everywhere. Dupe.com, a startup that “scans the web for visually similar products,” puts it like this: “You can keep shopping like a normie, taking prices at face value and meekly accepting that you’re limited by your bank account. Or, you can use Dupe to find lookalikes you can actually afford.” The Dupe.com ethos is one of relentless hacking, where shoppers’ job is to pull one over on the brands that “outsmart” them with “overpriced” product offerings. Finding something cheaper elsewhere isn’t just a pastime. It’s a noble way to fight back against greedy companies, Dupe.com asserts.\n\nBut whether it’s luxury handbags or designer furniture, someone always profits, and it is never the shopper. The Wirkin didn’t sink Hermès at all — in fact, profits were up 15 percent in 2024 at the fashion house, and the Wirkin was but a footnote to investors (the company’s CEO, Axel Dumas, said the fake bags were “detestable”). Fake Birkins are less likely to eat into Hermès’ profits than they are to serve as a kind of advertisement for the company, dangling on the arms of shoppers who believe they are opting out of — rather than buying into — the allure of a purse that costs more than an SUV.\n\nDupe.com, on the other hand, could only function in an internet filled with repetition: the company is essentially an elaborate affiliate linking operation, and it makes a commission every time a user purchases a product using Dupe’s personalized link. As long as consumers have endless access to thousands of options of near-identical products, there is no bottom; Dupe.com spits out alternatives for $1,800 Isamu Noguchi lamps as well as flimsy $22 phone cases. (The startup was sued in 2024 by Williams-Sonoma Inc., which accused Dupe.com of deceptive advertising.)\n\nBobby Ghoshal, co-founder and CEO of Dupe.com, notes that the platform also surfaces more expensive options along with cheaper alternatives. “For us, it’s about consumer choice,” Ghoshal says. Ghoshal, who describes himself as a furniture collector and enthusiast, believes Dupe.com can “kindle [a] fire” within shoppers who appreciate upscale design and aesthetics but cannot presently afford it. Maybe a $7,000 Eames chair is out of reach for a fresh college graduate, but they can stomach shelling out a few hundred dollars for a knockoff, he said.\n\nGhoshal is careful to describe Dupe.com not just as a search engine for dupes, but as an avenue for tastemaking: by sitting in their living room on an Eames look-alike and ottoman, the shopper begins to lust after the real thing, the thinking goes. But using Dupe.com to find something more expensive is at odds with how Ghoshal and his team market it: why would someone want to splurge on the “real” thing if they could get a dupe for less? If a dupe is just a temporary Band-Aid on an aching desire for something you covet, then no level of resemblance will make you forget the original. Used in this way, Dupe.com strikes me not so much as a cheat code as it is adding to the ever-expanding list of things you desire. It is a way to spend money, not save it.\n\nThe internet is built on repetition, and its main characters ascend based on their replicability: nobody wants to see your outfit or your desk setup if they can’t also go out and buy your life (or copies of it) for themselves. From coffee shops and beige homes to entire neighborhoods in the cultural capitals of the world, the internet has fueled formulas for living, the rules of which are molded by the endless scroll of recommended content. Many people’s experience of the web is of floating heads on their phone screen talking about the same topics, hawking the same products, and following the same career paths. They vlog from their puffy-cloud sofas that are meant to evoke a different, more expensive couch that celebrities like — except they are made by companies with names like QQU, HOOOWOOO, and LINSY HOME.\n\nFor the most part, original products and their dupes go on existing next to each other, taking turns appearing in targeted ads and influencer videos in a sort of uneasy equilibrium: everyone knows it’s happening, but few have the time, money, or legal standing to take down every dupe. Ho, preternaturally gifted at riding the internet wave thanks to her years spent online, seems to have figured out a powerful (and effective) tactic outside the courtroom: good old public shaming.\n\n“HELP. I’m being silenced!!” Ho captioned a video from February. In the clip, viewed more than 5 million times on TikTok, she says a dupe of the Pirouette Skort was for sale on Nordstrom Rack — it was even available in pastel purple, like the one Taylor Swift wore, except made by the brand X by Gottex. In the video, Ho says that after her team sent Nordstrom and X by Gottex cease and desist letters, X by Gottex’s lawyers sent her an email threatening legal action if she pursued “any further infringement allegations.” Nordstrom and X by Gottex did not respond to The Verge’s questions about the incident. (Because the case did not proceed to court, there is no ruling on whether the X by Gottex version did indeed infringe on Ho’s design patent. Nevertheless, the skort does appear to be quite similar to Popflex’s Pirouette Skort — the X by Gottex item was marketed as the Tutu Skort.)\n\nAfter Ho posted the video, angry fans flooded Nordstrom’s comment section on Instagram and reported that the item appeared to be unavailable for purchase shortly after Ho posted about it. The incident, of course, has not put an end to the Popflex dupes; in fact, part of Ho’s professional brand as a business owner is that she aggressively goes after designs she believes copy her products. She regularly writes on her blog about the dupes she encounters, and every high-profile incident she discusses on her social pages is both a call-out and a marketing opportunity: another company making a look-alike product is the perfect moment for Ho to tell consumers why her designs are better. She says she even offered Nordstrom the option to carry the Popflex skort — an “enemies to lovers arc,” as she put it. So far, she says that hasn’t happened.\n\nThe Popflex Skort and its endless clones are the physical manifestations of the experience of being online, where copying is good for business rather than a mark of theft. “Jumping on trends” is part of the job of an influencer, and brands must do the same to seem relevant, relatable, and current. The popularity of the Pirouette Skort was bolstered by the same systems of influencers, recommendation algorithms, and frictionless shopping that turbocharged the copies Ho now fights against.\n\nThe Pirouette Skort takes the textures and culture of the internet and brings it offline, where there are untold numbers of young women who are wearing the (mostly) same lilac purple mesh skort. Whether it is the “real” version or a look-alike doesn’t matter so much — these are all just the Viral Taylor Swift Skirt now. If imitation is the highest form of flattery, digital dupes escaping into the real world is a perverse compliment to Ho and countless others who’ve seen the same happen to their designs. If you are a designer who believes you are being ripped off, maybe the best you can do is ride the wave until the next viral thing comes around (surely it will) with the hope that eventually your imitators will get bored and move on to something else. At that point, perhaps your creation becomes your own again, and it can sink or swim on its own merit — it can just be a normal skirt, finally unmoored from its replicability."
    },
    {
      "source": "Windows Central",
      "author": "Jennifer Young",
      "title": "Nintendo is taking desperate measures in patent infringement case against Palworld — and it's looking a little weird",
      "description": "Nintendo’s legal campaign against Palworld continues with Pocketpair making gameplay changes to dodge infringement claims. Now Nintendo is rewriting its own patents mid-lawsuit — a move experts say looks like a last-ditch effort.",
      "url": "https://www.windowscentral.com/gaming/nintendo-is-taking-desperate-measures-in-patent-infringement-case-against-palworld-and-its-looking-a-little-weird",
      "urlToImage": "https://cdn.mos.cms.futurecdn.net/ehrBHKXifFQ469VGHMhJfi.jpg",
      "publishedAt": "2025-07-16T21:30:00Z",
      "content": "It's been pretty quiet on the news front in the ongoing battle between Nintendo and PocketPair over alleged patent infringement in Palworld. However, while the mainstream audience awaits a final verdict, legal and patent experts are watching the case and digging through the documentation in impressive detail.\n\nThis latest report from Gamesfray has uncovered some rather unusual behaviour from Nintendo as they continue the fight to shut down Palworld, and it seems that the fight in Japan isn't landing the punches they'd hoped.\n\nNintendo is making some unusual moves, including rewriting one of its own patents mid-lawsuit, and, in the words of the experts, \"It’s bizarre.\"\n\nNintendo are moving the goalposts mid-case\n\nTo quickly recap, Nintendo is suing PocketPair for patent infringement in Japan, based on the resemblance of certain mechanics in Palworld to Pokémon. There are 3 patents in total included in the suit for which Nintendo are seeking the equivalent of $66k in damages. Two about capturing monsters, and one about how you can switch between riding different creatures.\n\nPocketPair's defense includes the use of prior art from numerous other games that also use similar mechanics, none of which Nintendo has pursued for damages. There is also clear evidence of Palworld demonstrating its mount switching mechanic, one of the patents in question, 6 months prior to Nintendo filing for the patent.\n\nSo, how has Nintendo responded to PocketPair's defense? According to this Gamesfray report Nintendo recently went to the Japan Patent Office (JPO) and asked to change the patent about switching rides in mid-air.\n\nThat’s a bold and unusual move, and one that usually only happens when the original patent looks weak. The updated version uses some bizarre language, including the phrase “even when,” which is not standard or clear in patent law.\n\nIf you want some light bedtime reading, you can read the entire claim online but it's specifically the wording changes to emphatic phrases like \"even when\" that are uses of language not generally seen in legal claims such as this, and it's even more telling that these amendments have been made mid-case.\n\nIt's just a phrase change, why the big deal?\n\nChanging a patent in the middle of an ongoing case is risky, and it signals that Nintendo perhaps doesn't believe its current claims will hold up in court. Using vague language like this doesn't inspire confidence, and the new wording is so clunky in the context of the entire claim that it may do more harm to their case than good.\n\nGamesfray refers to the move as a \"Hail Mary\", and further states it's \"a desperate attempt to win by doing something odd.\"\n\nHow about the US case?\n\nNintendo is still trying to build its case on US soil too, but so far they haven't actually filed a lawsuit there. They've been awarded 4 patents in the US so far, but PocketPair is continuously changing Palworld to effectively become a moving target.\n\nFor example, PocketPair removed the Pal-specific gliding mechanics, you can no longer switch between mounts on the fly, and they removed the ability to throw Pal Spheres to summon captured Pals.\n\nThe more changes Palworld implements, the more useless Nintendo's patent claims become. Though Nintendo appears to be tweaking claims in the hope of tailoring them to whatever version of the game comes next.\n\nCould Nintendo win?\n\nThere is, of course, still every chance that Nintendo is successful with its claims. After all, it has a solid history of winning cases.\n\nHowever, the company's goal may not just be impacting Palworld, but scaring off indie studios from making games that feel even remotely similar to Pokémon.\n\nThough, as we've seen from announcements like the upcoming Aniimo, that tactic doesn't seem to be working either.\n\nBut what do you think?\n\nIs Nintendo right to defend its patents this aggressively, or is it another case of trying to stomp out competition?\n\nAre these kinds of legal fights protecting IP or killing creativity? Let me know in the comments!"
    },
    {
      "source": "Yahoo Entertainment",
      "author": "Neha Gupta",
      "title": "Truist Sees Upside in BridgeBio Pharma’s (BBIO) ATTR-CM Strategy",
      "description": "BridgeBio Pharma Inc. (NASDAQ:BBIO) is one of the best biotech stocks to buy according to billionaire Steve Cohen. On July 21, Truist Securities initiated...",
      "url": "https://finance.yahoo.com/news/truist-sees-upside-bridgebio-pharma-034754120.html",
      "urlToImage": "https://s.yimg.com/ny/api/res/1.2/t1oNgH.r97zBI99BQ0XY1w--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzM-/https://media.zenfs.com/en/insidermonkey.com/3cff52bdb5bd9e91dc13d43a22831dff",
      "publishedAt": "2025-07-25T03:47:54Z",
      "content": "BridgeBio Pharma Inc. (NASDAQ:BBIO) is one of the best biotech stocks to buy according to billionaire Steve Cohen. On July 21, Truist Securities initiated coverage of BBIO with a Buy rating and a $66 price target, spotlighting the promising launch of Attruby for treating ATTR-CM.\n\nA closeup of a medical technician handling a sample of a biopharmaceutical drug.\n\nCiting its growing use as a first-line therapy due to ease of access and better stabilizer data, Truist sees strong traction among tafamidis-progressing patients.\n\nWith the ATTR-CM market expected to reach $20 billion, Truist views significant upside for Attruby despite ongoing patent litigation from Pfizer. The firm remains optimistic about BridgeBio’s IP position and also highlighted near-term growth catalysts from its late-stage pipeline, particularly starting in the second half of 2025.\n\nBridgeBio Pharma Inc. (NASDAQ:BBIO) is a biopharmaceutical company that develops and delivers transformative medicines for genetic diseases and cancers with clear genetic drivers. It boasts a pipeline of candidate drugs, some in early-stage research and others in advanced clinical trials.\n\nWhile we acknowledge the potential of BBIO as an investment, we believe certain AI stocks offer greater upside potential and carry less downside risk. If you're looking for an extremely undervalued AI stock that also stands to benefit significantly from Trump-era tariffs and the onshoring trend, see our free report on the best short-term AI stock.\n\nREAD NEXT: 12 Best Airline Stocks to Buy According to Hedge Funds and Goldman Sachs REIT Stocks: Top 12 Stock Picks."
    },
    {
      "source": "Photorumors.com",
      "author": "PR admin",
      "title": "Insta360 responds to GoPro’s patent infringement allegations",
      "description": "A week ago, the International Trade Commission ruled that Insta360 infringed on GoPro's HERO camera design patent. A few days later, Insta360 responded that the International Trade Commission (ITC) has rejected GoPro's utility patent claims against Insta360. …",
      "url": "https://photorumors.com/2025/07/20/insta360-responds-to-gopros-patent-infringement-allegations/",
      "urlToImage": "https://photorumors.com/wp-content/uploads/2022/03/Insta360-camera-logo.jpg",
      "publishedAt": "2025-07-20T15:36:00Z",
      "content": "A week ago, the International Trade Commission ruled that Insta360 infringed on GoPro's HERO camera design patent. A few days later, Insta360 responded that the International Trade Commission (ITC) has rejected GoPro's utility patent claims against Insta360. A final determination from the full Commission is expected by November 10, 2025. Here is the full text of GoPro's statement and the response from Insta360 (see the filing notice here):\n\nITC Determines Infringement of GoPro's Iconic HERO Camera Design\n\nSAN MATEO, Calif., July 11, 2025 /PRNewswire/ -- Today GoPro, Inc. (NASDAQ: GPRO) announced a United States Administrative Law Judge (ALJ) of the International Trade Commission (ITC) in Washington, D.C. issued an Initial Determination, finding that China-based Insta360 violated federal law by importing and selling in the United States products that infringe GoPro intellectual property covering GoPro's iconic HERO camera design.\n\nGoPro is pleased with the ALJ's findings that Insta360 infringed on a patent covering GoPro's iconic HERO camera design (US Patent D789,435), as well as its validation of multiple patent claims covering GoPro's industry-leading HyperSmooth video stabilization (US Patent 10,574,894 and 10,958,840).\n\nIn addition, GoPro intends to brief other outstanding issues in its infringement case against Insta360 with the full Commission. The ITC is expected to issue its Final Determination on all of GoPro's infringement claims against Insta360 by November 10, 2025.\n\nThis litigation process has strengthened GoPro's intellectual property portfolio and underscores GoPro's history of category-defining innovation, which has resulted in more than 1,500 US patents.\n\n\"GoPro welcomes fair competition as it drives us to innovate, but we will litigate to protect our IP when we believe it is being infringed,\" said Nicholas Woodman, GoPro's founder and CEO. \"We have been an American innovator and market leader for twenty-three years, and we will not sit idle while we believe others unjustly take advantage of our hard work, investment and innovation.\"\n\nInsta360 Issues Statement on U.S. ITC Initial Determination\n\nInitial Ruling Confirms the Non-Infringement or Invalidity of GoPro's Utility Patents\n\nLOS ANGELES July 11, 2025 /PRNewswire/ -- The U.S. International Trade Commission (ITC) has rejected GoPro's utility patent claims against Insta360 in Investigation No. 337-TA-1400. The initial determination, which was issued by an Administrative Law Judge in Washington, D.C. yesterday, ruled that that GoPro's five utility patents relating to stabilization, horizon leveling, distortion, and aspect ratio conversion are invalid, not infringed, or both. In addition to clearing Insta360 completely as to these five patents, the Administrative Law Judge confirmed that Insta360's proactive design updates fall outside the scope of GoPro's lone asserted design patent (U.S. Patent No. D789,435).\n\n\"The U.S. International Trade Commission's initial determination affirms what many in our industry already know: the future belongs to innovators, not litigators,\" said JK Liu, Founder of Insta360. \"While GoPro sought to block competition by asserting a wide array of patents, the majority of those claims were either found not to be infringed or ruled invalid. That speaks volumes.\"\n\n\"This isn't just about Insta360. This is about an ecosystem where established players use litigation as a business strategy, hoping to stall faster, smarter, more agile challengers. It's a familiar playbook: instead of building better products, they try to slow down those who do. We will continue to stand up for our products, our team, and the creative community we serve - and we will not be deterred by legal maneuvering aimed at protecting market share rather than consumers.\"\n\nInsta360 also filed multiple inter partes review (IPR) petitions with the U.S. Patent and Trademark Office (USPTO) to challenge the validity of GoPro's patents, some of which remain under review. The company has also initiated patent litigation in China against entities affiliated with GoPro.\n\nThe ITC's preliminary determination does not affect Insta360's U.S. product availability or its global operations. The company continues to manufacture and sell its full line of cameras without restriction.\n\nA final determination from the full Commission is expected by November 10, 2025."
    },
    {
      "source": "IPWatchdog.com",
      "author": "Drew Berweger",
      "title": "Understanding IP Matters: Celebrated MIT Engineer and Entrepreneur Develops Medical Devices to Treat Cancer and Other Diseases",
      "description": "Universities have seen their role change since the Bayh-Dole Act was passed in 1980. They have been incentivized for both innovation and economic development, with patents being an important part of that landscape. With impending reductions in government fund…",
      "url": "https://ipwatchdog.com/2025/07/16/understanding-ip-matters-celebrated-mit-engineer-entrepreneur/id=190402/",
      "urlToImage": "https://ipwatchdog.com/wp-content/uploads/2025/07/Michael-Cima-11.jpg",
      "publishedAt": "2025-07-16T13:42:06Z",
      "content": "Universities have seen their role change since the Bayh-Dole Act was passed in 1980. They have been incentivized for both innovation and economic development, with patents being an important part of that landscape.\n\nWith impending reductions in government funding for universities, finding new ways to support research has become an incredibly important activity. But replacing the funding is no simple matter and universities will have to find ways to do it.\n\nOn the current episode of Understanding IP Matters (UIPM), Michael Cima, a celebrated professor, inventor, and entrepreneur, discusses the intellectual property generated in universities and the impact potential cuts to university funding can have. Dr. Cima, who works closely with renowned inventor and entrepreneur Robert Langer (1,600 papers and 1,500 patents) describes the most important attributes for being a great inventor and provides key lessons to learn as a student.\n\nDr. Cima is a Professor of Materials Science and Engineering at the Massachusetts Institute of Technology and has an appointment at the David H. Koch Institute for Integrative Cancer Research. He is also the Chair of Engineering at MIT. He was appointed faculty director of the Lemelson-MIT Program in 2009, an organization that inspires young people to be inventive and has a nationwide reach. Professor Cima is author or co-author of over 300 peer reviewed scientific publications, 58 U.S. patents, and is a recognized expert in the field of materials processing. His business exits have included a sale to Johnson & Johnson.\n\nIn this episode of “Understanding IP Matters,” Cima and host Bruce Berman discuss:\n\nNational Institutes of Health (NIH) funding for research at universities originates pharmaceuticals and medical devices that support the health of our country. “So, when you see these massive cuts, I worry about the long-term impact that has on both economic development and the health of our population,” says Cima.\n\nThat the loss of NIH funding to universities is very concerning and “will slow research progress.”\n\nThat support of early-stage research serves the public through early development of many new medical products, so much so that it is “hard to point to just about any new medical product that wasn’t touched by NIH support.”\n\nThere are “three main attributes to great inventors.” The “first is curiosity, curious people are collecting solutions to problems they haven’t encountered”. The second skill is “the skill of empathy”, “getting into the shoes of somebody else.” And the final one is leadership, which “is actually the hardest one to teach.”\n\nInventors who are involved in patent litigation become better inventors because the process allows them “to learn a lot about how to defend a patent by going through litigation… When you are involved in drafting new patents, you are thinking 10 years down the line, when the product may be litigated.”\n\nShare\n\nDrew Berweger Drew Berweger is a Patent Attorney at Chiesa Shahinian & Giantomasi PC (“CSG Law”) in New York City. Drew has drafted hundreds of patent applications and Office Action responses, as [...see more]\n\nWarning & Disclaimer: The pages, articles and comments on IPWatchdog.com do not constitute legal advice, nor do they create any attorney-client relationship. The articles published express the personal opinion and views of the author as of the time of publication and should not be attributed to the author’s employer, clients or the sponsors of IPWatchdog.com."
    }
  ]
}