{
  "query": "Technology",
  "date": "2025-07-27T19:40:40.806811",
  "articles": [
    {
      "source": "The Verge",
      "author": "Jess Weatherbed",
      "title": "Delta Air Lines is using AI to set the maximum price you’re willing to pay",
      "description": "Delta Air Lines is leaning into dynamic ticket pricing that uses artificial intelligence to individually determine the highest fee you’d willingly pay for flights, according to comments Fortune spotted in the company’s latest earnings call. Following a limite…",
      "url": "https://www.theverge.com/news/709556/delta-air-lines-ai-ticket-price-rollout",
      "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/07/gettyimages-2223798482.jpg?quality=90&strip=all&crop=0%2C10.740554568055%2C100%2C78.518890863889&w=1200",
      "publishedAt": "2025-07-18T10:50:57Z",
      "content": "Delta Air Lines is leaning into dynamic ticket pricing that uses artificial intelligence to individually determine the highest fee you’d willingly pay for flights, according to comments Fortune spotted in the company’s latest earnings call. Following a limited test of the technology last year, Delta is planning to shift away from static ticket prices entirely after seeing “amazingly favorable” results.\n\n“We will have a price that’s available on that flight, on that time, to you, the individual,” Delta president Glen Hauenstein told investors in November, having started to test the technology on 1 percent of its ticket prices. Delta currently uses AI to influence 3 percent of its ticket prices, according to last week’s earnings call, and is aiming to increase that to 20 percent by the end of this year. “We’re in a heavy testing phase,” said Hauenstein. “We like what we see. We like it a lot, and we’re continuing to roll it out.”\n\nWhile personalized pricing isn’t unique to Delta, the airline has been particularly candid about embracing it. During that November call, Hauenstein said the AI ticketing system is “a full reengineering of how we price and how we will be pricing in the future,” and described the rollout as “a multiyear, multi-step process.” Hauenstein acknowledged that Delta was excited about the initial revenue results it saw in testing, but noted the shift to AI-determined pricing could “be very dangerous, if it’s not controlled and it’s not done correctly.”\n\nDelta’s personalized AI pricing tech is provided by travel firm Fetcherr, which also partners with Virgin Atlantic, Azul, WestJet, and Viva Aerobus. In Delta’s case, the AI will act as a “super analyst” that operates 24/7 to determine custom ticket prices that should be offered to individual customers in real time, per specific flights and times.\n\nAirlines have varied their ticket prices for customers on the same routes for many years, depending on a range of factors, including how far in advance the booking is made, what website or service it’s being booked with, and even the web browser the customer is using. Delta is no exception, but AI pricing looks set to supercharge the approach.\n\nDelta has taken heat for charging customers different prices for flights, having rolled back the decision to price tickets higher for solo travelers compared to groups in May. It’s not entirely clear how invasive Delta’s AI ticketing will be when it analyzes customers to figure out prices, but Fortune notes that it has privacy advocates concerned.\n\n“They are trying to see into people’s heads to see how much they’re willing to pay,” Justin Kloczko of Consumer Watchdog told the publication. “They are basically hacking our brains.” Arizona Sen. Ruben Gallego described it as “predatory pricing” that’s designed to “squeeze you for every penny.”"
    },
    {
      "source": "The Verge",
      "author": "Emma Roth",
      "title": "Ring reintroduces video sharing with police",
      "description": "Ring has once again started letting police request footage from users. Axon, a law enforcement technology company and maker of TASER, announced in April that it’s partnering with Ring to allow customers to share “relevant video with law enforcement to help so…",
      "url": "https://www.theverge.com/news/709836/ring-police-video-sharing-police-axon-partnership",
      "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/07/Battery_Doorbell_Pro_3.webp?quality=90&strip=all&crop=0%2C10.319647285754%2C100%2C79.360705428493&w=1200",
      "publishedAt": "2025-07-18T16:51:26Z",
      "content": "The video doorbell company is partnering with Taser maker Axon.\n\nThe video doorbell company is partnering with Taser maker Axon.\n\nThe Verge Daily\n\nA free daily digest of the news that matters most.\n\nEmail (required)\n\nBy submitting your email, you agree to our Terms and Privacy Notice. This site is protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply."
    },
    {
      "source": "The Verge",
      "author": "Jay Peters",
      "title": "Indiegogo is getting acquired by Gamefound, a board game crowdfunding company",
      "description": "Indiegogo is being acquired by the board game crowdfunding platform Gamefound, which plans on “integrating Indiegogo’s global community of 38 million members with Gamefound’s state-of-the-art crowdfunding technology,” the companies announced this morning. Gam…",
      "url": "https://www.theverge.com/news/712733/indiegogo-acquired-gamefound-crowdfunding",
      "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/07/GAMEFOUND_INDIEGOGO.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
      "publishedAt": "2025-07-24T00:02:30Z",
      "content": "Indiegogo is being acquired by the board game crowdfunding platform Gamefound, which plans on “integrating Indiegogo’s global community of 38 million members with Gamefound’s state-of-the-art crowdfunding technology,” the companies announced this morning.\n\nGamefound has built “the best tech in crowdfunding, hands down,” Indiegogo CEO Julie dePontbriand tells The Verge. “By joining forces, we’re aligning with the strongest platform out there — so we can bring the very best tools, features, and experience to our creators.” Gamefound has become a huge player in crowdfunding for tabletop games, with six of the top 10 tabletop campaigns last year, according to Polygon.\n\nThe threat of Trump’s tariffs mean that now is a potentially vulnerable time for the tabletop industry, as many board game makers rely on manufacturing in China. (A group of tabletop game makers filed a lawsuit in April in an attempt to stop them.) While the current status of the tariffs remains fluid, people are still backing games. Per dePontbriand: “Gamefound hasn’t seen a drop in US backer activity or overall campaign funding.”\n\nAs part of the acquisition, Indiegogo will change its pricing to be in line with Gamefound’s, which is “a flat 5 percent fee” and “no additional fees for any promotional placements” on Indiegogo and its newsletters, dePontbriand says. That change will be going into effect “immediately.”\n\nIndiegogo will also follow Gamefound’s tipping policy, which gives 100 percent of tips directly to a creator “outside of the checkout flow,” dePontbriand says. This change is in the works, and “we’ll provide an update on timing as soon as possible.”\n\nBoth platforms will continue to exist separately, though Gamefound campaigns will be featured on both Gamefound and Indiegogo “for added exposure,” per the press release.\n\ndePontbriand says she will remain the CEO of Indiegogo, while Gamefound CEO Marcin Świerkot will “take on the role of Group CEO.”"
    },
    {
      "source": "The Verge",
      "author": "Jay Peters",
      "title": "T-Mobile is bringing low-latency tech to 5G for the first time",
      "description": "Over the next few weeks, T-Mobile is expanding support for the L4S standard, which stands for “Low Latency, Low Loss, Scalable Throughput.” The technology helps high-priority internet packets move along with fewer delays, to make video calls and cloud games f…",
      "url": "https://www.theverge.com/news/710312/t-mobile-low-latency-l4s-5g",
      "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/04/acastro_STK067__01.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
      "publishedAt": "2025-07-21T12:52:07Z",
      "content": "Latency hitches that can interrupt video calls or slow down browsing could be reduced with L4S, and T-Mobile is the first wireless company using it in the US. \r\nLatency hitches that can interrupt vid… [+1986 chars]"
    },
    {
      "source": "The Verge",
      "author": "Lauren Feiner, Justine Calma, Hayden Field, Adi Robertson",
      "title": "Breaking down Trump’s big gift to the AI industry",
      "description": "President Donald Trump's plan to promote America's AI dominance involves discouraging \"woke AI,\" slashing state and federal regulations, and laying the groundwork to rapidly expand AI development and adoption. Trump's proposal, released on July 23rd, is a swe…",
      "url": "https://www.theverge.com/policy/713788/trump-ai-action-plan-explainer",
      "urlToImage": "https://platform.theverge.com/wp-content/uploads/sites/2/2025/07/gettyimages-2225853634.jpg?quality=90&strip=all&crop=0%2C10.732984293194%2C100%2C78.534031413613&w=1200",
      "publishedAt": "2025-07-25T14:35:40Z",
      "content": "President Donald Trump’s plan to promote America’s AI dominance involves discouraging “woke AI,” slashing state and federal regulations, and laying the groundwork to rapidly expand AI development and adoption. Trump’s proposal, released on July 23rd, is a sweeping endorsement of the technology, full of guidance that ranges from specific executive actions to directions for future research.\n\nSome of the new plan’s provisions (like promoting open-source AI) have garnered praise from organizations that are often broadly critical of Trump, but the loudest acclaim has come from tech and business groups, whose members stand to gain from fewer restrictions on AI. “The difference between the Trump administration and Biden’s is effectively night and day,” says Patrick Hedger, director of policy at tech industry group NetChoice. “The Biden administration did everything it could to command and control the fledgling but critical sector … The Trump AI Action Plan, by contrast, is focused on asking where the government can help the private sector, but otherwise, get out of the way.”\n\nOthers are far more ambivalent. Future of Life Institute, which led an Elon Musk-backed push for an AI pause in 2023, said it was heartened to see the Trump administration acknowledge serious risks, like bioweapons or cyberattacks, could be exacerbated by AI. “However, the White House must go much further to safeguard American families, workers, and lives,” says Anthony Aguirre, FLI’s executive director. “By continuing to rely on voluntary safety commitments from frontier AI corporations, it leaves the United States at risk of serious accidents, massive job losses, extreme concentrations of power, and the loss of human control. We know from experience that Big Tech promises alone are simply not enough.”\n\nFor now, here are the ways that Trump aims to promote AI.\n\n‘Consider a state’s AI regulatory climate when making funding decisions’\n\nCongress failed to pass a moratorium on states enforcing their own AI laws as part of a recent legislative package. But a version of that plan was resurrected in this document. “AI is far too important to smother in bureaucracy at this early stage, whether at the state or Federal level,” the plan says. “The Federal government should not allow AI-related Federal funding to be directed toward states with burdensome AI regulations that waste these funds, but should also not interfere with states’ rights to pass prudent laws that are not unduly restrictive to innovation.”\n\nTo do this, it suggests federal agencies that dole out “AI-related discretionary funding” should “limit funding if the state’s AI regulatory regimes may hinder the effectiveness of that funding or award.” It also suggests the Federal Communications Commission (FCC) “evaluate whether state AI regulations interfere with the agency’s ability to carry out its obligations and authorities under the Communications Act of 1934.”\n\nThe Trump administration also wants the Federal Trade Commission (FTC) to take a hard look at existing AI regulations and agreements to see what it can scale back. It recommends the agency reevaluate investigations launched during the Biden administration “to ensure that they do not advance theories of liability that unduly burden AI innovation,” and suggests it could throw out burdensome aspects of existing FTC agreements. Some AI-related actions taken during the Biden administration that the FTC might now reconsider include banning Rite Aid’s use of AI facial recognition that allegedly falsely identified shoplifters, and taking action against AI-related claims the agency previously found to be deceptive.\n\n‘Our AI systems must be free from ideological bias’\n\nTrump’s plan includes policies designed to help encode his preferred politics in the world of AI. He’s ordered a revision of the Biden-era National Institute of Standards and Technology (NIST) AI Risk Management Framework — a voluntary set of best practices for designing safe AI systems — removing “references to misinformation, Diversity, Equity, and Inclusion, and climate change.” (The words “misinformation” and “climate change” don’t actually appear in the framework, though misinformation is discussed in a supplementary file.)\n\nIn addition to that, a new executive order bans federal agencies from procuring what Trump deems “woke AI” or large language models “that sacrifice truthfulness and accuracy to ideological agendas,” including things like racial equity.\n\nThis section of the plan “seems to be motivated by a desire to control what information is available through AI tools and may propose actions that would violate the First Amendment,” says Kit Walsh, director of the Electronic Frontier Foundation (EEF). “The plan seeks to require that ‘the government only contracts with’ developers who meet the administration’s ideological criteria. While the government can choose to purchase only services that meet such criteria, it cannot require that developers refrain from also providing non-government users other services conveying other ideas.”\n\n‘Establishing a dynamic, ‘try-first’ culture for AI’\n\nThe administration describes the slow uptake of AI tools across the economy, including in sensitive areas like healthcare, as a “bottleneck to harnessing AI’s full potential.” The plan describes this cautious approach as one fueled by “distrust or lack of understanding of the technology, a complex regulatory landscape, and a lack of clear governance and risk mitigation standards.” To promote the use of AI, the White House encourages a “‘try-first’ culture for AI across American industry.”\n\nThis includes creating domain-specific standards for adopting AI systems and measuring productivity increases, as well as regularly monitoring how US adoption of AI compares to international competitors. The White House also wants to integrate AI tools throughout the government itself, including by detailing staff with AI expertise at various agencies to other departments in need of that talent, training government employees on AI tools, and giving agencies ample access to AI models. The plan also specifically calls out the need to “aggressively adopt AI within its Armed Forces,” including by introducing AI curricula at military colleges and using AI to automate some work.\n\n‘Retrain and help workers thrive’\n\nAll this AI adoption will profoundly change the demand for human labor, the plan says, likely eliminating or fundamentally changing some jobs. The plan acknowledges that the government will need to help workers prepare for this transition period by retraining people for more in-demand roles in the new economy and providing tax benefits for certain AI training courses.\n\nOn top of preparing to transition workers from traditional jobs that might be upended by AI, the plan discusses the need to train workers for the additional roles that might be created by it. Among the jobs that might be needed for this new reality are “electricians, advanced HVAC technicians, and a host of other high-paying occupations,” the plan says.\n\n‘Create a supportive environment for open models’\n\nThe administration says it wants to “create a supportive environment for open models,” or AI models that allow users to modify the code that underpins them. Open models have certain “pros,” like being more accessible to startups and independent developers.\n\nGroups like EFF and the Center for Democracy and Technology (CDT), which were critical of many other aspects of the plan, applauded this part. EFF’s Walsh called it a “positive proposal” to promote “the development of open models and making it possible for a wider range of people to participate in shaping AI research and development. If implemented well, this could lead to a greater diversity of viewpoints and values reflected in AI technologies, compared to a world where only the largest companies and agencies are able to develop AI.”\n\nThat said, there are also serious “cons” to the approach that the AI Action Plan didn’t seem to get into. For instance, the nature of open models makes them easier to trick and misalign for purposes like creating misinformation on a large scale, or chemical or biological weapons. It’s easier to get past built-in safeguards with such models, and it’s important to think critically about the tradeoffs before taking steps to drive open-source and open-weight model adoption at scale.\n\n‘Expedite environmental permitting’\n\nTrump signed an executive order on July 23rd meant to fast track permitting for data center projects. The EO directs the commerce secretary to “launch an initiative to provide financial support” that could include loans, grants, and tax incentives for data centers and related infrastructure projects.\n\nFollowing a similar move by former President Joe Biden, Trump’s plan directs agencies to identify federal lands suitable for the “large-scale development” of data centers and power generation. The EO tells the Department of Defense to identify suitable sites on military installations and the Environmental Protection Agency (EPA) to identify polluted Superfund and Brownfield sites that could be reused for these projects.\n\nThe Trump administration is hellbent on dismantling environmental regulations, and the EO now directs the EPA to modify rules under the Clean Air Act, Clean Water Act, and Toxic Substances Control Act to expedite permitting for data center projects.\n\nThe EO and the AI plan, similar to a Biden-era proposal, direct agencies to create “categorical exclusions” for federally supported data center projects that would exclude them from detailed environmental reviews under the National Environmental Policy Act. And they argue for using new AI tools to speed environmental assessments and applying the “Fast-41 process” to data center projects to streamline federal permitting.\n\nThe Trump administration is basically using the AI arms race as an excuse to slash environmental regulations for data centers, energy infrastructure, and computer chip factories. Last week, the administration exempted coal-fired power plants and facilities that make chemicals for semiconductor manufacturing from Biden-era air pollution regulations.\n\n‘Navigating the complex energy landscape of the 21st century’\n\nThe plan admits that AI is a big factor “increasing pressures on the [power] grid.” Electricity demand is rising for the first time in more than a decade in the US, thanks in large part to data centers — a trend that could trigger blackouts and raise Americans’ electricity bills. Trump’s AI plan lists some much-needed fixes to stabilize the grid, including upgrading power lines and managing how much electricity consumers use when demand spikes.\n\nBut the administration is saying that the US needs to generate more electricity to power AI just as it’s stopping renewable energy growth, which is like trying to win a race in a vehicle with no front wheels. It wants to meet growing demand with fossil fuels and nuclear energy. “We will continue to reject radical climate dogma,” the plan says. It argues for keeping existing, mostly fossil-fueled power plants online for longer and limiting environmental reviews to get data centers and new power plants online faster.\n\nThe lower cost of gas generation has been killing coal power plants for years, but now a shortage of gas turbines could stymie Trump’s plans. New nuclear technologies that tech companies are investing in for their data centers probably won’t be ready for commercial deployment until the 2030s at the earliest. Republicans, meanwhile, have passed legislation to hobble the solar and wind industries that have been the fastest-growing sources of new electricity in the US.\n\n‘Prioritize fundamental advancements in AI interpretability’\n\nThe Trump administration accurately notes that while developers and engineers know how today’s advanced AI models work in a big-picture way, they “often cannot explain why a model produced a specific output. This can make it hard to predict the behavior of any specific AI system.” It’s aiming to fix that, at least when it comes to some high-stakes use cases.\n\nThe plan states that the lack of AI explainability and predictability can lead to issues in defense, national security, and “other applications where lives are at stake,” and it aims to promote “fundamental breakthroughs on these research problems.” The plan’s recommended policy actions include launching a tech development program led by the Defense Advanced Research Projects Agency to advance AI interpretability, control systems, and security. It also said the government should prioritize fundamental advancements in such areas in its upcoming National AI R&D Strategic Plan and, perhaps most specifically, that the DOD and other agencies should coordinate an AI hackathon to allow academics to test AI systems for transparency, effectiveness, and vulnerabilities.\n\nIt’s true that explainability and unpredictability are big issues with advanced AI. Elon Musk’s xAI, which recently scored a large-scale contract with the DOD, recently struggled to stop its Grok chatbot from spouting pro-Hitler takes — so what happens in a higher-stakes situation? But the government seems unwilling to slow down while this problem is addressed. The plan states that since “AI has the potential to transform both the warfighting and back-office operations of the DOD,” the US “must aggressively adopt AI within its Armed Forces if it is to maintain its global military preeminence.”\n\nThe plan also discusses how to better evaluate AI models for performance and reliability, like publishing guidelines for federal agencies to conduct their own AI system evaluations for compliance and other reasons. That’s something most industry leaders and activists support greatly, but it’s clear what the Trump administration has in mind will lack a lot of the elements they have been pushing for.\n\nEvaluations likely will focus on efficiency and operations, according to the plan, and not instances of racism, sexism, bias, and downstream harms.\n\nCourtrooms and AI tools mix in strange ways, from lawyers using hallucinated legal citations to an AI-generated appearance of a deceased victim. The plan says that “AI-generated media” like fake evidence “may present novel challenges to the legal system,” and it briefly recommends the Department of Justice and other agencies issue guidance on how to evaluate and deal with deepfakes in federal evidence rules.\n\n‘Improving the financial market for compute’\n\nFinally, the plan recommends creating new ways for the research and academic community to access AI models and compute. The way the industry works right now, many companies, and even academic institutions, can’t access or pay for the amount of compute they need on their own, and they often have to partner with hyperscalers — providers of large-scale cloud computing infrastructure, like Amazon, Google, and Microsoft — to access it.\n\nThe plan wants to fix that issue, saying that the US “has solved this problem before with other goods through financial markets, such as spot and forward markets for commodities.” It recommends collaborating with the private sector, as well as government departments and the National Science Foundation’s National AI Research Resource pilot to “accelerate the maturation of a healthy financial market for compute.” It didn’t offer any specifics or additional plans for that."
    }
  ]
}